dynamicMeshWakeGenerator/dynamicMeshWakeGenerator/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          | 
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         | 
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "constant/triSurface/testCase.fms";

maxCellSize 0.0025;

//boundaryCellSize 0.00125;

boundaryLayers
{
    patchBoundaryLayers
    {
       WG
       {
            nLayers 10;
            thicknessRatio 1.15;
        }
    }
    patchBoundaryLayers
    {
       Hub
       {
            nLayers 10;
            thicknessRatio 1.15;
        }
    }
    patchBoundaryLayers
    {
       Shroud
       {
            nLayers 10;
            thicknessRatio 1.15;
        }
    }
}

// ************************************************************************* //
